Config/Catalogs/ИсточникиДанныхДляРасчетовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИсточникиДанныхДляРасчетовБюджетирования</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаИсточникаДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДатыОтбораДанныхИсточника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДатаГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеДатыГраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальнаяГраницаОтсчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыГраницОтбораИсточникаПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачальнойГраницыОтсчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СдвигВПериодах</Name>
							<Comment>Сдвиг (в периодах планирования)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСмещения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОстатковОборотовБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияИсточника</Name>
					<Comment>Измерения источника для возможного распределения значений ресурсов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзмерениеБюджетирования</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИзмеренияБюджетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоРегиструБюджетирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотовПоБюджетам</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиОборотовПоБюджетам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вычитать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоРегиструБухгатерии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОборота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субк1Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субк2Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субк3Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубк1Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубк2Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубк3Условие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КорСубконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вычитать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/ВидыГраницОтбораИсточникаПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыГраницОтбораИсточникаПланирования</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонецПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяДата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ИсточникиДанныхДляРасчетовБюджетирования/Forms/ФормаЭлементаУправояемая/Ext/Form/Module.bsl
//&НаСервере
//Перем ПостроительОтчета;


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//	ПостроительОтчета = Новый ПостроительОтчета;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРегистраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	ПараметрыОткрытия = Новый СТруктура("ТекущееЗначение",Объект.ИмяРегистра);
	РезультатВыбора = Неопределено;
	
	ОткрытьФорму("Справочник.ИсточникиДанныхДляРасчетовБюджетирования.Форма.ФормаВыбораИсточника",ПараметрыОткрытия,ЭтаФорма,,,, Новый ОписаниеОповещения("ПредставлениеРегистраНачалоВыбораЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРегистраНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = Результат;
	Если РезультатВыбора = Неопределено Тогда
		Возврат;	
	Конецесли;
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Объект,РезультатВыбора); // ИмяРегистра, ПредставлениеРегистра
		
		Объект.ДатыОтбораДанныхИсточника.Очистить();
		Объект.Показатели.Очистить();
		Объект.ИзмеренияИсточника.Очистить();
		
		ЗаполнитьНастройкиПоИсточнику();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПоИсточнику()
	ИмяРегистра = Объект.ИмяРегистра;
	ПредставлениеРегистра = Объект.ПредставлениеРегистра;
	
	//ПОСТРОИТЕЛЬ ОТЧЕТА Очистим отбор
	//////Сч=0;
	//////Пока Сч<ПостроительОтчета.Отбор.Количество() Цикл
	//////	ПостроительОтчета.Отбор.Удалить(Сч);
	//////	Сч=Сч+1;
	//////КонецЦикла;
	//////
	//////Сч=0;
	//////Пока Сч<ПостроительОтчета.ДоступныеПоля.Количество() Цикл
	//////	
	//////	Поле=ПостроительОтчета.ДоступныеПоля[Сч];
	//////	ПостроительОтчета.ДоступныеПоля.Удалить(Поле);
	//////	
	//////КонецЦикла;
	
	Если Найти(ИмяРегистра,"Запрос.")=0 Тогда
		
		МассивОтбора = Новый Массив;
		
		ДобавитьПоляРегистра(МассивОтбора);			
		
		ТекстПоказатели="";
		ТекстИзмерения="";
		
		Для каждого Показатель Из Объект.Показатели Цикл
			
			ТекстПоказатели=ТекстПоказатели+", 
			|СУММА("+Показатель.Имя+") КАК "+Показатель.Имя; 
			
		КонецЦикла; 
		
		Для Каждого Элемент Из МассивОтбора Цикл
			
			ТекстИзмерения=ТекстИзмерения+", 
			|"+Элемент+".* КАК "+Элемент;
			
		КонецЦикла;
		
		Если Найти(ИмяРегистра,"Обороты")>0 ИЛИ Найти(ПредставлениеРегистра,": движения с субконто")>0 Тогда
			ТекстИзмерения=ТекстИзмерения+",
			|Период";
		ИначеЕсли Найти(ПредставлениеРегистра,"движения:")>0 Тогда
			ТекстИзмерения=ТекстИзмерения+",
			|НачалоПериода(Период,День) КАК Период";
		ИначеЕсли Найти(ИмяРегистра,"&МоментВремени")>0 Тогда
			ТекстИзмерения=ТекстИзмерения+",
			|&МоментВремени КАК Период";
		КонецЕсли;
		
		ТекстЗапроса="ВЫБРАТЬ ";
		
		ТекстЗапроса=ТекстЗапроса+Сред(ТекстПоказатели,2);
		ТекстЗапроса=ТекстЗапроса+"
		|{ВЫБРАТЬ "+Сред(ТекстИзмерения,2)+"}
		|ИЗ
		|"+ИмяРегистра+" КАК ТаблицаРегистра";
		Если Найти(ПредставлениеРегистра,"движения:")>0 Тогда
			ТекстЗапроса=ТекстЗапроса+"
			|ГДЕ (ТаблицаРегистра.Период МЕЖДУ &НачалоПериода И &КонецПериода)
			|И (ТаблицаРегистра.Активность=Истина)";
			Если Найти(ПредставлениеРегистра,"движения: оборот")=0 Тогда
				ТекстЗапроса=ТекстЗапроса+"
				|И (ТаблицаРегистра.ВидДвижения=&ВидДвижения)";
			КонецЕсли;
		КонецЕсли;
		ТекстЗапроса=ТекстЗапроса+"		
		|{ГДЕ "+Сред(ТекстИзмерения,2)+"}";
		
		// моя примочка
		Объект.ТекстЗапроса = ТекстЗапроса;
		// конец моя примочка
		
		////////ПОСТРОИТЕЛЬ ОТЧЕТА 
		//////ПостроительОтчета.Текст=ТекстЗапроса;
		//////
		//////Если Найти(ПредставлениеРегистра,"движения: приход")>0 Тогда
		//////	
		//////	ПостроительОтчета.Параметры.Вставить("ВидДвижения",ВидДвиженияНакопления.Приход);
		//////	
		//////ИначеЕсли Найти(ПредставлениеРегистра,"движения: расход")>0 Тогда
		//////	
		//////	ПостроительОтчета.Параметры.Вставить("ВидДвижения",ВидДвиженияНакопления.Расход);
		//////	
		//////КонецЕсли; 
		//////
		//////Для Каждого Элемент Из МассивОтбора Цикл
		//////	
		//////	ПолеОтчета=ПостроительОтчета.ДоступныеПоля[Элемент];
		//////	ПолеОтчета.Отбор=Истина;
		//////	
		//////КонецЦикла;
		////////ПОСТРОИТЕЛЬ ОТЧЕТА 
		
	Иначе
		
		ВыборПроцедурыНастройки(ИмяРегистра);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборПроцедурыНастройки(ИмяРегистра)
	Если ИмяРегистра="Запрос.НДСПоПланамПродаж" Тогда
		НДСпоПланамПродаж();
	Иначе
		//	
	КонецЕсли; 	
КонецПроцедуры // ВыборПроцедурыНастройки()

&НаСЕрвере
Процедура НДСпоПланамПродаж()
	
	ТекстЗапроса="ВЫБРАТЬ
	|	СУММА(ПланПродажТовары.СуммаНДС) КАК СуммаНДС
	|{ВЫБРАТЬ	
	|ПланПродажТовары.Номенклатура.*,
	|ПланПродаж.Подразделение.*,
	|ПланПродаж.Сценарий.*}
	|ИЗ
	|	Документ.ПланПродаж КАК ПланПродаж
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПланПродаж.СоставПлана КАК ПланПродажТовары
	|		ПО ПланПродажТовары.Ссылка = ПланПродаж.Ссылка
	|
	|ГДЕ
	|	ПланПродаж.Проведен И
	|	ПланПродаж.УчитыватьНДС И
	|	ПланПродаж.Сценарий.ДетализацияПланирования = &ДетализацияПланирования И
	|	ПланПродаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|{ГДЕ ПланПродажТовары.Номенклатура.*,
	|ПланПродаж.Подразделение.*,
	|ПланПродаж.Сценарий.*}";
	
	Объект.ТекстЗапроса = ТекстЗапроса;
	//////				 //ПОСТРОИТЕЛЬ ОТЧЕТА 
	//////				 ПостроительОтчета.Текст=ТекстЗапроса;
	//////	ПостроительОтчета.Параметры.Вставить("ДетализацияПланирования",Перечисления.ДетализацияПланирования.Номенклатура);
	
	//////	ПостроительОтчета.ДоступныеПоля.Номенклатура.Отбор=Истина;
	//////	ПостроительОтчета.ДоступныеПоля.Подразделение.Отбор=Истина;
	//////	ПостроительОтчета.ДоступныеПоля.Сценарий.Отбор=Истина;
	////////ПОСТРОИТЕЛЬ ОТЧЕТА 
	Если Объект.Показатели.Количество()=0 Тогда
		ДобавитьПоказательВТаблицу("Сумма НДС по плану","СуммаНДС");
		//НовыйПоказатель=Показатели.Добавить();
		//НовыйПоказатель.Представление="Сумма НДС по плану";
		//НовыйПоказатель.Имя="СуммаНДС";
		//НовыйПоказатель.Использование=Истина;
		ДобавитьГраницуОтбора("НачалоПериода", "Дата начала отбора данных",Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода);
		//НоваяГраницаОтбора=ДатыОтбораДанныхИсточника.Добавить();
		//НоваяГраницаОтбора.ИмяДатаГраницы="НачалоПериода";
		//НоваяГраницаОтбора.ПредставлениеДатыГраницы="Дата начала отбора данных";
		//НоваяГраницаОтбора.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода;
		ДобавитьГраницуОтбора("КонецПериода", "Дата конца отбора данных",Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода);
		//НоваяГраницаОтбора=ДатыОтбораДанныхИсточника.Добавить();
		//НоваяГраницаОтбора.ИмяДатаГраницы="КонецПериода";
		//НоваяГраницаОтбора.ПредставлениеДатыГраницы="Дата конца отбора данных";
		//НоваяГраницаОтбора.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода;
		
	КонецЕсли;
	
КонецПроцедуры // НДСпоПланамПродаж()


&НаСервере
// Процедура заполняет таблицу показателей источника
// Параметры
//  Регистр (строка) - имя регистра в метаданных
//  ТаблицаРегистра (строка) - тип таблицы регистра 
//
Процедура ДобавитьПоляРегистра(МассивОтбора)
	ИмяРегистра = Объект.ИмяРегистра;
	ПредставлениеРегистра = Объект.ПредставлениеРегистра;
	
	ВидРегистраПоМетаданным=Лев(ИмяРегистра,Найти(ИмяРегистра,".")-1);
	
	ТаблицаРегистра=СтрЗаменить(ИмяРегистра,ВидРегистраПоМетаданным+".","");
	
	Сч=Найти(ТаблицаРегистра,".");
	
	Периодический=Истина;
	
	Если Сч>0 Тогда	
		ИмяРегистраПоМетаданным=Лев(ТаблицаРегистра,Сч-1);
	ИначеЕсли Найти(ПредставлениеРегистра,"движения:")>0 Тогда
		ИмяРегистраПоМетаданным=ТаблицаРегистра;
	Иначе
		ИмяРегистраПоМетаданным=ТаблицаРегистра;
		Периодический=Ложь;  // Непериодический регистр сведений.
	КонецЕсли;
	
	МетаданныеРегистр=Метаданные[СтрЗаменить(ВидРегистраПоМетаданным,"Регистр","Регистры")][ИмяРегистраПоМетаданным];
	
	// Добавляются показатели источника
	Если Объект.Показатели.Количество()=0 Тогда
		
		Для каждого Ресурс Из МетаданныеРегистр.Ресурсы Цикл
			
			Если Найти(ИмяРегистра,"РегистрБухгалтерии")>0 Тогда
				
				Если Найти(ПредставлениеРегистра,": обороты с корреспонденцией")>0  Тогда
					
					Если НЕ Ресурс.ПризнакУчета=Неопределено Тогда
						ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот Дт", Ресурс.Имя+"ОборотДт");
						//НовыйПоказатель=Объект.Показатели.Добавить();
						//НовыйПоказатель.Представление=Ресурс.Имя+": оборот Дт";
						//НовыйПоказатель.Имя=Ресурс.Имя+"ОборотДт";
						//НовыйПоказатель.Использование=Истина;
						
						ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот Кт",Ресурс.Имя+"ОборотКт");
						//НовыйПоказатель=Объект.Показатели.Добавить();
						//НовыйПоказатель.Представление=Ресурс.Имя+": оборот Кт";
						//НовыйПоказатель.Имя=Ресурс.Имя+"ОборотКт";
						//НовыйПоказатель.Использование=Истина;
						
					Иначе
						ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот",Ресурс.Имя+"Оборот");
						//НовыйПоказатель=Объект.Показатели.Добавить();
						//НовыйПоказатель.Представление=Ресурс.Имя+": оборот";
						//НовыйПоказатель.Имя=Ресурс.Имя+"Оборот";
						//НовыйПоказатель.Использование=Истина;
						
					КонецЕсли;
					
				ИначеЕсли Найти(ПредставлениеРегистра,": остатки и обороты")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": конечный остаток",Ресурс.Имя+": конечный остаток");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": конечный остаток";
					//НовыйПоказатель.Имя=Ресурс.Имя+"КонечныйОстаток";
					//НовыйПоказатель.Использование=Истина;
					
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": конечный остаток Дт",Ресурс.Имя+"КонечныйОстатокДт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": конечный остаток Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"КонечныйОстатокДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": конечный остаток Кт", Ресурс.Имя+"КонечныйОстатокКт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": конечный остаток Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"КонечныйОстатокКт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": конечный развернутый остаток Дт", Ресурс.Имя+"КонечныйРазвернутыйОстатокДт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": конечный развернутый остаток Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"КонечныйРазвернутыйОстатокДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": конечный развернутый остаток Кт", Ресурс.Имя+"КонечныйРазвернутыйОстатокКт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": конечный развернутый остаток Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"КонечныйРазвернутыйОстатокКт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": начальный остаток",Ресурс.Имя+"НачальныйОстаток");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": начальный остаток";
					//НовыйПоказатель.Имя=Ресурс.Имя+"НачальныйОстаток";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу( Ресурс.Имя+": начальный остаток Дт",Ресурс.Имя+"НачальныйОстатокДт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": начальный остаток Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"НачальныйОстатокДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": начальный остаток Кт",Ресурс.Имя+"НачальныйОстатокКт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": начальный остаток Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"НачальныйОстатокКт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": начальный развернутый остаток Дт",Ресурс.Имя+"НачальныйРазвернутыйОстатокДт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": начальный развернутый остаток Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"НачальныйРазвернутыйОстатокДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": начальный развернутый остаток Кт",Ресурс.Имя+"НачальныйРазвернутыйОстатокКт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": начальный развернутый остаток Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"НачальныйРазвернутыйОстатокКт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу( Ресурс.Имя+": оборот", Ресурс.Имя+"Оборот");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Оборот";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот Дт",Ресурс.Имя+"ОборотДт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"ОборотДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот Кт",Ресурс.Имя+"ОборотКт");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"ОборотКт";
					//НовыйПоказатель.Использование=Истина;
					
					
				ИначеЕсли Найти(ПредставлениеРегистра,": остатки")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": остаток", Ресурс.Имя+"Остаток");
					//НовыйПоказатель=Объект.Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": остаток";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Остаток";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": остаток Дт", Ресурс.Имя+"ОстатокДт");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": остаток Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"ОстатокДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": остаток Кт",Ресурс.Имя+"ОстатокКт");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": остаток Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"ОстатокКт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": развернутый остаток Дт",Ресурс.Имя+"РазвернутыйОстатокДт");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": развернутый остаток Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"РазвернутыйОстатокДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": развернутый остаток Кт",Ресурс.Имя+"РазвернутыйОстатокКт");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": развернутый остаток Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"РазвернутыйОстатокКт";
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,": обороты")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот",Ресурс.Имя+"Оборот");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Оборот";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот Дт",Ресурс.Имя+"ОборотДт");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот Дт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"ОборотДт";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот Кт",Ресурс.Имя+"ОборотКт");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот Кт";
					//НовыйПоказатель.Имя=Ресурс.Имя+"ОборотКт";
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,": движения с субконто")>0 Тогда
					
					Если НЕ Ресурс.ПризнакУчета=Неопределено Тогда
						ДобавитьПоказательВТаблицу(Ресурс.Имя+": Дт",Ресурс.Имя+"Дт");
						//НовыйПоказатель=Показатели.Добавить();
						//НовыйПоказатель.Представление=Ресурс.Имя+": Дт";
						//НовыйПоказатель.Имя=Ресурс.Имя+"Дт";
						//НовыйПоказатель.Использование=Истина;
						ДобавитьПоказательВТаблицу(Ресурс.Имя+": Кт",Ресурс.Имя+"Кт");
						//НовыйПоказатель=Показатели.Добавить();
						//НовыйПоказатель.Представление=Ресурс.Имя+": Кт";
						//НовыйПоказатель.Имя=Ресурс.Имя+"Кт";
						//НовыйПоказатель.Использование=Истина;
						
					Иначе
						ДобавитьПоказательВТаблицу(Ресурс.Имя,Ресурс.Имя);
						//НовыйПоказатель=Показатели.Добавить();
						//НовыйПоказатель.Представление=Ресурс.Имя;
						//НовыйПоказатель.Имя=Ресурс.Имя;
						//НовыйПоказатель.Использование=Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли Найти(ИмяРегистра,"РегистрНакопления")>0 Тогда
				
				Если Найти(ПредставлениеРегистра,": обороты")  Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот",Ресурс.Имя+"Оборот");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Оборот";
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,": остатки и обороты")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": начальный остаток",Ресурс.Имя+"НачальныйОстаток");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": начальный остаток";
					//НовыйПоказатель.Имя=Ресурс.Имя+"НачальныйОстаток";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": приход",Ресурс.Имя+": приход");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": приход";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Приход";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот",Ресурс.Имя+"Оборот");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Оборот";
					//НовыйПоказатель.Использование=Истина;
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": расход",Ресурс.Имя+"Расход");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": расход";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Расход";
					//НовыйПоказатель.Использование=Истина;
					
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": конечный остаток",Ресурс.Имя+"КонечныйОстаток");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": конечный остаток";
					//НовыйПоказатель.Имя=Ресурс.Имя+"КонечныйОстаток";
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,": остатки")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": остаток",Ресурс.Имя+"Остаток");
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": остаток";
					//НовыйПоказатель.Имя=Ресурс.Имя+"Остаток";
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,"движения: приход")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": приход",Ресурс.Имя);
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": приход";
					//НовыйПоказатель.Имя=Ресурс.Имя;
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,"движения: расход")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": расход",Ресурс.Имя);
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": расход";
					//НовыйПоказатель.Имя=Ресурс.Имя;
					//НовыйПоказатель.Использование=Истина;
					
				ИначеЕсли Найти(ПредставлениеРегистра,"движения: оборот")>0 Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя+": оборот",Ресурс.Имя);
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя+": оборот";
					//НовыйПоказатель.Имя=Ресурс.Имя;
					//НовыйПоказатель.Использование=Истина;
					
				КонецЕсли;
				
			ИначеЕсли Найти(ИмяРегистра,"РегистрСведений")>0 Тогда
				
				ТипыРесурса=Ресурс.Тип.Типы();
				
				Если ТипыРесурса.Количество() = 1 И ТипыРесурса[0]=Тип("Число") Тогда
					ДобавитьПоказательВТаблицу(Ресурс.Имя,Ресурс.Имя);
					//НовыйПоказатель=Показатели.Добавить();
					//НовыйПоказатель.Представление=Ресурс.Имя;
					//НовыйПоказатель.Имя=Ресурс.Имя;
					//НовыйПоказатель.Использование=Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Добавляются границы отбора данных
	
	Если Объект.ДатыОтбораДанныхИсточника.Количество()=0 И Периодический Тогда
		
		Если Найти(ПредставлениеРегистра,"обороты")>0 ИЛИ Найти(ПредставлениеРегистра,"движения:")>0 
			ИЛИ Найти(ПредставлениеРегистра,": движения с субконто")>0 Тогда
			ДобавитьГраницуОтбора("НачалоПериода","Дата начала отбора данных",Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода);
			//НоваяГраницаОтбора=ДатыОтбораДанныхИсточника.Добавить();
			//НоваяГраницаОтбора.ИмяДатаГраницы="НачалоПериода";
			//НоваяГраницаОтбора.ПредставлениеДатыГраницы="Дата начала отбора данных";
			//НоваяГраницаОтбора.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода;
			ДобавитьГраницуОтбора("КонецПериода","Дата конца отбора данных",Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода);
			//НоваяГраницаОтбора=ДатыОтбораДанныхИсточника.Добавить();
			//НоваяГраницаОтбора.ИмяДатаГраницы="КонецПериода";
			//НоваяГраницаОтбора.ПредставлениеДатыГраницы="Дата конца отбора данных";
			//НоваяГраницаОтбора.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода;
			
		Иначе
			ДобавитьГраницуОтбора("МоментВремени","Дата значения",Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода);
			//НоваяГраницаОтбора=ДатыОтбораДанныхИсточника.Добавить();
			//НоваяГраницаОтбора.ИмяДатаГраницы="МоментВремени";
			//НоваяГраницаОтбора.ПредставлениеДатыГраницы="Дата значения";
			//НоваяГраницаОтбора.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавляются поля источника
	СписокПолей=Новый СписокЗначений;
	
	Для Каждого Измерение Из МетаданныеРегистр.Измерения Цикл
		
		Если ((Найти(ИмяРегистра,"ОборотыДтКт")>0) ИЛИ (Найти(ИмяРегистра,"ДвиженияССубконто")>0)) 
			
			И(Не Измерение.ПризнакУчета=Неопределено) Тогда
			
			СписокПолей.Добавить(Измерение.Имя+"Дт",Измерение.Синоним+" Дт");
			МассивОтбора.Добавить(Измерение.Имя+"Дт");
			
			СписокПолей.Добавить(Измерение.Имя+"Кт",Измерение.Синоним+" Кт");
			МассивОтбора.Добавить(Измерение.Имя+"Кт");
			
		Иначе
			
			СписокПолей.Добавить(Измерение.Имя,Измерение.Синоним);
			МассивОтбора.Добавить(Измерение.Имя);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Найти(ПредставлениеРегистра,"движения:")>0 Или Найти(ПредставлениеРегистра,": движения с субконто")>0 Тогда
		
		Для Каждого Реквизит Из МетаданныеРегистр.Реквизиты Цикл
			
			СписокПолей.Добавить(Реквизит.Имя,Реквизит.Синоним);
			МассивОтбора.Добавить(Реквизит.Имя);
			
		КонецЦикла;
		
		СписокПолей.Добавить("Регистратор","Регистратор");
		МассивОтбора.Добавить("Регистратор");
		
	КонецЕсли;	
	
	Если Найти(ИмяРегистра,"РегистрБухгалтерии")>0 Тогда
		
		Если (МетаданныеРегистр.Корреспонденция) 
			И ((Найти(ИмяРегистра,"ОборотыДтКт")>0) ИЛИ (Найти(ИмяРегистра,"ДвиженияССубконто")>0)) Тогда
			
			МассивОтбора.Добавить("СчетДт");
			МассивОтбора.Добавить("СчетКт");
			
			Для Индекс=1 по МетаданныеРегистр.ПланСчетов.МаксКоличествоСубконто Цикл
				
				МассивОтбора.Добавить("СубконтоДт"+Индекс);
				МассивОтбора.Добавить("СубконтоКт"+Индекс);
				
			КонецЦикла;
			
		Иначе
			
			МассивОтбора.Добавить("Счет");
			
			Для Индекс=1 по МетаданныеРегистр.ПланСчетов.МаксКоличествоСубконто Цикл
				
				МассивОтбора.Добавить("Субконто"+Индекс);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДобавитьПоляРегистра()

&НаСервере
Процедура ДобавитьГраницуОтбора(ИмяДатаГраницы,ПредставлениеДатыГраницы,НачальнаяГраницаОтсчета)
	НоваяГраницаОтбора=Объект.ДатыОтбораДанныхИсточника.Добавить();
	НоваяГраницаОтбора.ИмяДатаГраницы=ИмяДатаГраницы;
	НоваяГраницаОтбора.ПредставлениеДатыГраницы=ПредставлениеДатыГраницы;
	НоваяГраницаОтбора.НачальнаяГраницаОтсчета=НачальнаяГраницаОтсчета;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоказательВТаблицу(Представление,Имя,Использование=Истина)
	НовыйПоказатель = Объект.Показатели.Добавить();
	НовыйПоказатель.Представление = Представление;
	НовыйПоказатель.Имя = Имя;
	НовыйПоказатель.Использование = Использование;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	Объект.ДатыОтбораДанныхИсточника.Очистить();
	
	нСтрока = Объект.ДатыОтбораДанныхИсточника.Добавить();
	нСтрока.ИмяДатаГраницы = "НачалоПериода";
	нСтрока.ПредставлениеДатыГраницы = "Дата начала периода";
	нСтрока.НачальнаяГраницаОтсчета	= ПредопределенноеЗначение("Перечисление.ВидыГраницОтбораИсточникаПланирования.НачалоПериода");
	
	нСтрока = Объект.ДатыОтбораДанныхИсточника.Добавить();
	нСтрока.ИмяДатаГраницы = "КонецПериода";
	нСтрока.ПредставлениеДатыГраницы = "Дата конца периода";
	нСтрока.НачальнаяГраницаОтсчета	= ПредопределенноеЗначение("Перечисление.ВидыГраницОтбораИсточникаПланирования.КонецПериода");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	//Если Объект.ПроизвольныйЗапрос Тогда
	//	Элементы.СтраницаНастройка.Видимость = Истина;
	//	Элементы.ПредставлениеРегистра.Доступность = Ложь;
	//	Элементы.Показатели.ИзменятьСоставСтрок=Истина;
	//	Элементы.ДатыОтбораДанныхИсточника.ИзменятьСоставСтрок=Истина;
	//	Элементы.ДатыОтбораДанныхИсточникаИмяДатаГраницы.Видимость=Истина;
	//	Элементы.ПоказателиПредставление.КнопкаВыбора=Истина;
	//Иначе
	//	Элементы.СтраницаНастройка.Видимость=Ложь;
	//	Элементы.ПредставлениеРегистра.Доступность=Истина;
	//	Элементы.Показатели.ИзменятьСоставСтрок=Ложь;
	//	Элементы.ДатыОтбораДанныхИсточника.ИзменятьСоставСтрок=Ложь;
	//	Элементы.ДатыОтбораДанныхИсточникаИмяДатаГраницы.Видимость=Ложь;
	//	Элементы.ПоказателиПредставление.КнопкаВыбора=Ложь;
	//КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	Конструктор = Новый КонструкторЗапроса;
	Если ЗначениеЗаполнено(Объект.ТекстЗапроса) Тогда
		Конструктор.Текст = Объект.ТекстЗапроса; 
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ОткрытьКонструкторЗапросаЗавершение",ЭтаФорма); 
	Конструктор.Показать(Оповещение); 
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьКонструкторЗапросаЗавершение(Текст, ДополнительныеПараметры) Экспорт 
	Если НЕ Текст = Неопределено Тогда 
		Объект.ТекстЗапроса = Текст; 
	КонецЕсли; 
КонецПроцедуры   

&НаКлиенте
Процедура ПроизвольныйЗапросПриИзменении(Элемент)
	Если Объект.ПроизвольныйЗапрос Тогда
		Объект.ПредставлениеРегистра="";
		Объект.ИмяРегистра="";
		УстановитьВидимость()
	Иначе
		ТекстВопроса="При смене режима редактирования текущие настройки будут утеряны.
		|Продолжить?";
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроизвольныйЗапросПриИзмененииЗавершение", ЭтаФорма), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйЗапросПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		Объект.Показатели.Очистить();
		Объект.ИзмеренияИсточника.Очистить();
		Объект.ДатыОтбораДанныхИсточника.Очистить();
		Объект.ТекстЗапроса = "";
	Иначе
		Объект.ПроизвольныйЗапрос=Истина;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры


&НаСервере
Процедура ПрименитьЗапросНаСервере()
	ПостроительОтчета=Новый ПостроительОтчета;
	ПостроительОтчета.Текст = ОБъект.ТекстЗапроса;
	ПостроительОтчета.ЗаполнитьНастройки();
	
	Объект.Показатели.Очистить();
	Объект.ДатыОтбораДанныхИсточника.Очистить();
	Объект.ИзмеренияИсточника.Очистить();
	
	Для Каждого Поле ИЗ ПостроительОтчета.ДоступныеПоля Цикл
		
		Если Строка(Поле.ТипЗначения)="Число" Тогда
			
			Если НЕ ПостроительОтчета.ВыбранныеПоля.Найти(Поле.Имя)=Неопределено Тогда
				
				СтрокаПоказатель=Объект.Показатели.Добавить();
				СтрокаПоказатель.Имя=Поле.Имя;
				СтрокаПоказатель.Представление=Поле.Представление;
				СтрокаПоказатель.Использование=Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПроверитьТекстЗапросаНаСервере()
	ПостроительОтчета=Новый ПостроительОтчета;
	Попытка
		ПостроительОтчета.Текст = ОБъект.ТекстЗапроса;
	Исключение
		РезультатПроверки = ОписаниеОшибки();
		Возврат РезультатПроверки;
	КонецПопытки;
	ПостроительОтчета.ЗаполнитьНастройки();
	Если ПостроительОтчета.ИзмеренияСтроки.Количество()>0 Тогда
		РезультатПроверки= "В запросе, используемом для источника данных, нельзя использовать итоги.
		|Воспользуйтесь группировками.";
		Возврат РезультатПроверки;
	КонецЕсли;
	Возврат "ОК";
КонецФункции

&НаКлиенте
Процедура ПрименитьЗапрос(Команда)
	РезультатПроверкиЗапроса = ПроверитьТекстЗапросаНаСервере();
	Если РезультатПроверкиЗапроса <> "ОК" Тогда
		ПоказатьПредупреждение(,РезультатПроверкиЗапроса);
		Возврат;	
	КонецЕсли;
	ПрименитьЗапросНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ИзмеренияИсточникаИмяПоляИсточникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	СписокПолей = ПолучитьСписокПолейИзЗапрсоа();
	
	ПараметрыОткрытия = Новый Структура("СписокПолей",СписокПолей);
	РезультатВыбора = Неопределено;
	ТекСтрока = Элементы.ИзмеренияИсточника.ТекущиеДанные;
	
	ОткрытьФорму("Справочник.ИсточникиДанныхДляРасчетовБюджетирования.Форма.ФормаВыборкаПоля",ПараметрыОткрытия,ЭтаФорма,,,, Новый ОписаниеОповещения("ИзмеренияИсточникаИмяПоляИсточникаНачалоВыбораЗавершение", ЭтаФорма,ТекСтрока), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзмеренияИсточникаИмяПоляИсточникаНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = Результат;
	Если РезультатВыбора = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ТекСтрока = ДополнительныеПараметры;
	ТекСтрока.ИмяПоляИсточника = РезультатВыбора.Имя;
	ТекСтрока.ПутьКДанным = РезультатВыбора.Имя;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПолейИзЗапрсоа()
	СписокПолей = Новый Соответствие;
	ПостроительОтчета=Новый ПостроительОтчета;
	ПостроительОтчета.Текст = ОБъект.ТекстЗапроса;
	ПостроительОтчета.ЗаполнитьНастройки();
	
	Для Каждого Поле ИЗ ПостроительОтчета.ДоступныеПоля Цикл
		Если Строка(Поле.ТипЗначения)<>"Число" Тогда
			Если ПостроительОтчета.ВыбранныеПоля.Найти(Поле.Имя)<>Неопределено Тогда
				СписокПолей.Вставить(Поле.Имя,Поле.ПутьКДанным);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат СписокПолей;
КонецФункции

&НаКлиенте
Процедура Проверить(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПроверитьИсточник(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПроверитьИсточник(ТабДок)
	
	ПостроительПроверка=Новый ПостроительОтчета;
	ПостроительПроверка.Текст=Объект.ТекстЗапроса;
	
	Если (НЕ Объект.ПроизвольныйЗапрос) И Найти(ВРЕГ(ПостроительПроверка.Текст),"НАЧАЛОПЕРИОДА(")=0 Тогда
		ПостроительПроверка.Текст=СтрЗаменить(ПостроительПроверка.Текст,"День","");
	КонецЕсли;

	ПостроительПроверка.ЗаполнитьНастройки();
	
	Если Объект.ПроизвольныйЗапрос Тогда
		
		//Для Каждого СтрокаПараметров Из Параметры Цикл
		//	
		//	ПостроительПроверка.Параметры.Вставить(СтрокаПараметров.ИмяПараметра, СтрокаПараметров.ЗначениеПараметра);
		//	
		//КонецЦикла;
		
	Иначе
		
		////Для Каждого Параметр Из ПостроительОтчета.Параметры Цикл
		////	
		////	ПостроительПроверка.Параметры.Вставить(Параметр.Ключ,Параметр.Значение);
		////	
		////КонецЦикла;
		
	КонецЕсли;
	
	Для каждого Граница Из Объект.ДатыОтбораДанныхИсточника Цикл
		
		Если Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.ФиксированнаяДата Тогда
			НачальнаяДатаГраницы=Граница.ДатаНачальнойГраницыОтсчета;
		ИначеЕсли Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.НачалоПериода Тогда
			НачальнаяДатаГраницы=НачалоМесяца(ТекущаяДата());
		ИначеЕсли Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода Тогда
			НачальнаяДатаГраницы=КонецМесяца(ТекущаяДата());
		КонецЕсли;
		
		Если НЕ Граница.СдвигВПериодах=0 Тогда
			
			Если Граница.НачальнаяГраницаОтсчета=Перечисления.ВидыГраницОтбораИсточникаПланирования.КонецПериода Тогда
				
				НачальнаяДатаГраницы=КонецДня(ОбщегоНазначения.ДобавитьИнтервал(НачальнаяДатаГраницы,Граница.ПериодСмещения,Граница.СдвигВПериодах));
				
			Иначе
				
				НачальнаяДатаГраницы=ОбщегоНазначения.ДобавитьИнтервал(НачальнаяДатаГраницы,Граница.ПериодСмещения,Граница.СдвигВПериодах);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПостроительПроверка.Параметры.Вставить(Граница.ИмяДатаГраницы,НачальнаяДатаГраницы);
		
	КонецЦикла;
	
	ПостроительПроверка.Выполнить(); 
	ПостроительПроверка.Вывести(ТабДок);
	
 КонецПроцедуры
 
//////////////////////////////////////////////
// СКД
/////////////////////////////////////////////
&НаКлиенте
Процедура РедактироватьСхемуКомпоновки(Команда)
	
	ОткрытьКонструкторСхемыКомпоновкиДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторСхемыКомпоновкиДанных()
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		// моя примочка
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
		ИсточникДанных.Имя = "ЛокальнаяБаза";
		ИсточникДанных.СтрокаСоединения = "";
		ИсточникДанных.ТипИсточникаДанных= "Local";
		
		
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.Имя = "Запрос";
		НаборДанных.ИсточникДанных = "ЛокальнаяБаза";
		НаборДанных.АвтоЗаполнениеДоступныхПолей=Истина;
		
		НаборДанных.Запрос = (""); //ЮЦАУ // Закрыл при переходе на УАТ
		//"ВЫБРАТЬ
		//|	ХозрасчетныйОбороты.Счет КАК СчетУчета,
		//|	ХозрасчетныйОбороты.Субконто1 КАК Контрагент,
		//|	ХозрасчетныйОбороты.Субконто2 КАК Договор,
		//|	ХозрасчетныйОбороты.Субконто3 КАК Документ,
		//|	ХозрасчетныйОбороты.СуммаОборот,
		//|	ХозрасчетныйОбороты.СуммаОборотДт,
		//|	ХозрасчетныйОбороты.СуммаОборотКт
		//|ИЗ
		//|	РегистрБухгалтерии.Хозрасчетный.Обороты КАК ХозрасчетныйОбороты");
		
		 
		
		// конец моя примочка
		
		//////// Настройки компоновщика настроек помещаются в редактируемую схему
		//////Если Не НеПомещатьНастройкиВСхемуКомпоновкиДанных Тогда
		//////	ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресРедактируемойСхемыКомпоновкиДанных);
		//////КонецЕсли;
		
		// Создается копия редактируемой схемы
		//СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресРедактируемойСхемыКомпоновкиДанных)));
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Для того, чтобы редактировать схему компоновки, необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	КомпоновкаДанныхКлиентСервер.ОчиститьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, КомпоновщикНастроек.Настройки);
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	КомпоновщикНастроек.ЗагрузитьНастройки( ВыбранноеЗначение.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
КонецПроцедуры
